{"question_token_to_idx": {"<NULL>": 0, "<START>": 1, "<END>": 2, "<UNK>": 3, "": 4, ";": 5, "Are": 6, "Do": 7, "Does": 8, "How": 9, "Is": 10, "The": 11, "There": 12, "What": 13, "a": 14, "an": 15, "and": 16, "another": 17, "any": 18, "anything": 19, "are": 20, "as": 21, "ball": 22, "balls": 23, "behind": 24, "big": 25, "block": 26, "blocks": 27, "blue": 28, "both": 29, "brown": 30, "color": 31, "cube": 32, "cubes": 33, "cyan": 34, "cylinder": 35, "cylinders": 36, "does": 37, "either": 38, "else": 39, "equal": 40, "fewer": 41, "front": 42, "gray": 43, "greater": 44, "green": 45, "has": 46, "have": 47, "how": 48, "in": 49, "is": 50, "it": 51, "its": 52, "large": 53, "left": 54, "less": 55, "made": 56, "many": 57, "material": 58, "matte": 59, "metal": 60, "metallic": 61, "more": 62, "number": 63, "object": 64, "objects": 65, "of": 66, "on": 67, "or": 68, "other": 69, "purple": 70, "red": 71, "right": 72, "rubber": 73, "same": 74, "shape": 75, "shiny": 76, "side": 77, "size": 78, "small": 79, "sphere": 80, "spheres": 81, "than": 82, "that": 83, "the": 84, "there": 85, "thing": 86, "things": 87, "tiny": 88, "to": 89, "visible": 90, "what": 91, "yellow": 92}, "program_token_to_idx": {"<NULL>": 0, "<START>": 1, "<END>": 2, "<UNK>": 3, "count": 4, "equal_color": 5, "equal_integer": 6, "equal_material": 7, "equal_shape": 8, "equal_size": 9, "exist": 10, "filter_color[blue]": 11, "filter_color[brown]": 12, "filter_color[cyan]": 13, "filter_color[gray]": 14, "filter_color[green]": 15, "filter_color[purple]": 16, "filter_color[red]": 17, "filter_color[yellow]": 18, "filter_material[metal]": 19, "filter_material[rubber]": 20, "filter_shape[cube]": 21, "filter_shape[cylinder]": 22, "filter_shape[sphere]": 23, "filter_size[large]": 24, "filter_size[small]": 25, "greater_than": 26, "intersect": 27, "less_than": 28, "query_color": 29, "query_material": 30, "query_shape": 31, "query_size": 32, "relate[behind]": 33, "relate[front]": 34, "relate[left]": 35, "relate[right]": 36, "same_color": 37, "same_material": 38, "same_shape": 39, "same_size": 40, "scene": 41, "union": 42, "unique": 43}, "answer_token_to_idx": {"<NULL>": 0, "<START>": 1, "<END>": 2, "<UNK>": 3, "0": 4, "1": 5, "10": 6, "2": 7, "3": 8, "4": 9, "5": 10, "6": 11, "7": 12, "8": 13, "9": 14, "blue": 15, "brown": 16, "cube": 17, "cyan": 18, "cylinder": 19, "gray": 20, "green": 21, "large": 22, "metal": 23, "no": 24, "purple": 25, "red": 26, "rubber": 27, "small": 28, "sphere": 29, "yellow": 30, "yes": 31}}